{
  "metadata": {
    "title": "Ziqiang He's Website",
    "description": "Ziqiang He's personal space, a world full of creativity and technology"
  },
  "navbar": {
    "home": "Home",
    "about": "About",
    "projects": "Projects",
    "contact": "Contact",
    "brand": "My Website"
  },
  "home": {
    "greeting": "Hey! I'm Ziqiang",
    "description": "I am a Full-stack Enginer <img src='/man_coder.png' alt='coder' class='inline-block h-6 w-6 rounded -mt-1' /> with years of experience in React and Node.js development. I previously worked as Staff Software Enginer in companies such as Alibaba <img src='/alibaba_white.png' alt='alibaba' class='inline-block h-6 w-8 rounded -mt-1' /> and Xiaohongshu <img src='/xiaohongshu.jpg' alt='xiaohongshu' class='inline-block h-6 w-6 rounded -mt-1' /> . In times of great change, I stay the same at heart — using tech to make life better. Let's exchange ideas, technologies, and opportunities together<img src='/star_glowing.png' alt='star' class='inline-block h-6 w-6 rounded -mt-1' />.",
    "aboutButton": "About Me"
  },
  "about": {
    "title": "Hey! I'm Ziqiang",
    "intro1": "A full-stack engineer based in Hangzhou, specializing in the React + Node.js tech stack with over 8 years of development experience.",
    "intro2": "I previously worked as a Staff Engineer at Alibaba and Xiaohongshu, focusing on e-commerce and SaaS. Specialized in high-performance, large-scale marketing platforms, real-time collaborative admin system, and global e-commerce apps. Skilled in performance optimization, SEO, and multi-device responsive development.",
    "intro3": "I'm experienced with English working environments and asynchronous collaboration across time zones, including North America, the UK, Singapore, and India. I also have 3 years of team management experience (6–10 people).",
    "intro4": "I love exploring new technologies and ideas, and enjoy building and refining products from the ground up. Outside of work, I like hiking, cycling, and shooting. Happy to connect and chat!",
    "skills": "Skills",
    "frontendDev": "Frontend",
    "backendDev": "Backend",
    "others": "Others",
    "devOps": "DevOps",
    "workExperience": "Career Experience",
    "urbanicTitle": "Urbanic",
    "urbanicPosition": "Full-stack Software Enginer  | 2023-Present",
    "urbanicDescription": "Urbanic is a London-based global fashion company. I'm responsible for developing the core e-commerce app and website using the React and Node.js tech stack. I also handle Google SEO optimization to drive user growth",
    "xiaohongshuTitle": "Xiaohongshu",
    "xiaohongshuPosition": "Staff Software Engineer | 2022-2023",
    "xiaohongshuDescription": "Led SaaS product development to enhance enterprise productivity by breaking data silos through info aggregation and workflow engine. Solved performance bottlenecks by introducing LRU caching and OT collaborative algorithms.",
    "alibabaTitle": "Alibaba",
    "alibabaPosition": "Senior Software Engineer | 2017-2022",
    "alibabaDescription": "Designed and implemented the Double 11 marketing page builder system, including a module center, page builder, and data delivery platform, supporting stable operation of millions of pages under billion-level traffic. Also responsible for C-end marketing projects like Tmall Black Box, covering H5 campaign pages and mobile app features.",
    "teambitionTitle": "Teambition",
    "teambitionPosition": "Node.js Engineer | 2015-2017",
    "teambitionDescription": "Developed Node.js backend services for enterprise project management, task tracking, and document collaboration. Designed and implemented an enterprise-grade role & permission control system, supporting the company’s growth from Series A to Series C funding.",
    "education": "Education",
    "universityName": "East China University of Science and Technology",
    "universityMajor": "Information and Computing Science | 2008-2012",
    "universityDescription": "Bachelor of Science, Top-tier Chinese University (985/211)",
    "backToHome": "Back to Home"
  },
  "projects": {
    "title": "Projects",
    "description": "These are some of the projects I have completed recently, including both company projects and personal projects. Welcome any discussions.",
    "backToHome": "Back to Home"
  },
  "contact": {
    "title": "Contact Me",
    "address": "Hangzhou, China",
    "email": "ziqianghe123@gmail.com",
    "linkedin": "LinkedIn",
    "github": "GitHub",
    "form": {
      "name": "Name",
      "email": "Email",
      "phone": "Phone",
      "phoneOptional": "Phone (Optional)",
      "message": "Message",
      "submit": "Submit",
      "namePlaceholder": "Enter your name",
      "emailPlaceholder": "Enter your email",
      "phonePlaceholder": "Enter your phone number",
      "messagePlaceholder": "Enter your message..."
    },
    "leaveMessage": "Leave a message",
    "backToHome": "Back to Home"
  }
}
